Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: ཨ་ག་རུ་ཡི་ཤིང་དག་དང་། །ཏམ་ལ་འདབ་རབ་མཛེས་དང་། །གུར་ཀུམ་དང་ནི་ཕུར་མོ་དང་། །ས་བོན་ཚོགས་ནི་མང་པོ་དང་། །གོར་ཤི་ཤ་དང་ཙན་དན་དམར། །ཧ་རིའི་ཙན་དན་དུ་མ་དང་། །ཤིང་ལྗོན་ཚོགས་ཀྱིས་འོད་མའི་ཚལ། །དེ་རིང་སྣང་ཞིང་མཆིས་པར་བགྱིས། །
en: “Pure agaru trees, Mangosteen trees with beautiful leaves, Saffron and sandwort, All with many seeds; Many kinds of sandalwood, White sandalwood, red sandalwood, and yellow sandalwood— Groves of trees such as these Have appeared today within the Bamboo Grove of Kalandaka.

source: སྐྱེད་མོས་ཚལ་དང་ནགས་ཚལ་དང་། །རྫིང་བུ་མཚོ་མང་དག་ན་ཡང་། །དུས་ཚིགས་ཀུན་གྱི་ཨུད་པལ་ཚོགས། །མེ་ཏོག་རྒྱས་པས་འོད་མའི་ཚལ། །དེ་རིང་སྣང་ཞིང་མཆིས་པར་བགྱིས། །
en: “Gardens, forests, Ponds, and great lakes, Covered with flowers And seasonal utpala blossoms, Have appeared today within the Bamboo Grove of Kalandaka.

source: རིན་ཆེན་ཀུན་གྱི་ཤིང་ལྗོན་དང་། །རིན་ཆེན་འཁྲི་ཤིང་ཡོངས་སུ་འཁྲི། །རིན་ཆེན་ཀུན་གྱི་ཨུད་པལ་གྱི། །མེ་ཏོག་ཚོགས་རྣམས་དེ་རིང་མཛེས། །
en: “All sorts of precious trees, Thoroughly wreathed in jewels, And all sorts of precious utpala flowers Have appeared today as adornments.

source: སངས་རྒྱས་མཐུས་ནི་དེ་རིང་དུ། །འདི་ལྟར་ཉི་ཟླའི་དཀྱིལ་འཁོར་དག །འཇིག་རྟེན་ཁམས་ནི་མང་པོར་ཡང་། །
en: “Today, through the Buddha’s power, The world realm has been made purer Than the spheres of the sun and moon.

source: དཀོན་པའི་ལས་མང་བགྱིས་པ་གདའ། །
en: Such a difficult task has been performed.

source: འཇིག་རྟེན་ཁམས་ནི་མང་པོ་དག །མེ་ལོང་གི་ནི་དཀྱིལ་འཁོར་ལྟར། །
en: “This world realm, which is greatly purified, Is like a great spherical mirror.

source: སེམས་ཅན་བྱེ་བ་མང་པོ་ཡིས། །འདི་ན་མཆིས་བཞིན་གསལ་བར་མཐོང་། །
en: All the many countless sentient beings Can be perceived clearly, as if they were right here.

source: ངང་པ་ཁྲུང་ཁྲུང་ངུར་པར་བཅས། །ཤང་ཤང་ཏེའུ་ནི་མང་པོ་དང་། །ཀ་རན་ད་བ་རྨ་བྱ་དང་། །དེ་བཞིན་ཁུ་བྱུག་ཀུ་ན་ལ། །བུང་བ་མཐའ་ཡས་བུང་བུང་སྒྲོགས། །རྒྱལ་པོའི་ཁབ་ཏུ་དེ་རིང་ནི། །བྱ་རྣམས་རྣམ་པ་དུ་མ་དག །སྐད་སྙན་འབྱིན་ཅིང་སྒྲོགས་པར་བགྱིད། །
en: “Swans, cranes, geese, Sundry partridges, Ducks, peacocks, Cuckoos, pheasants, And a myriad of buzzing bees— Today in Rājagṛha All these various birds and flying creatures Call out in their pleasing voices.

source: གནག་པ་དང་ནི་ལྗང་ཁུའི་མདོག །མདོག་སྡུག་དང་ནི་སྔོ་བ་དང་། །པད་མ་དཀར་པོའི་མདོག་ཅན་གྱི། །ངང་མཆོག་གླང་ཆེན་སེང་གེ་རྣམས། །སེང་གེའི་སྒྲ་ནི་སྒྲོགས་བགྱིད་ཅིང་། །རྒྱལ་པོའི་ཁབ་ནི་དེ་རིང་མཛེས། །
en: “Colored black and green, Pleasingly colored in blue, Colored white like a lotus blossom, Great swans, elephants, and lions Call out with their lions’ roars, Beautifying Rājagṛha today.

source: འཛམ་གླིང་ཡུལ་འཁོར་བཅས་པ་དང་། །ལུང་པར་བཅས་དང་ཚོང་རྡལ་བཅས། །འབྱོར་རྒྱས་དག་ལ་སེམས་ཅན་རྣམས། །ལྷ་ཡི་བདེ་བའི་ལོངས་སྤྱོད་སྤྱད། །
en: “The entire land of Jambudvīpa, With all its countries and cities, Is pure and vastly abundant; within this, all sentient beings Partake of divine bliss and enjoyments.

source: སེམས་དགའ་མོས་ཤིང་རབ་ཚིམ་ནས། །སེམས་ཅན་རྣམ་པ་དུ་མ་ཡིས། །ལས་དྲག་མང་པོའི་སྡིག་སྤངས་ནས། །ཡིད་བདེ་རབ་ཏུ་དུལ་བར་གྱུར། །
en: “Their minds joyful, utterly satiated, All the different varieties of sentient beings, Having abandoned the many serious karmic misdeeds, Have become utterly tamed, their minds at peace.

source: དེ་རིང་ཁྱོད་ཞི་ཞབས་དྲུང་ལྷགས། །ཕྱག་འཚལ་ནས་ནི་དེ་རིང་དུ། །རྣམ་པ་མང་པོའི་ཚུལ་གྱིས་འཇུག །ཉེ་གནས་ཆོ་ག་མཆོག་ལ་བཟོད། །
en: “Today, having come and prostrated At your excellent feet, We will readily engage in the various aspects Of the supreme practices of your close disciples.

source: སེམས་ཅན་ལྷ་མང་བྱེ་བ་རྣམས། །དམ་པའི་ཆོས་ཀྱི་ཚིག་ཀྱང་སྲུང་། །
en: “All the myriad sentient beings and gods Will uphold the words of the sacred Dharma.

source: དམ་པའི་ཆོས་མཆོག་རབ་ཀྱི་ཚུལ། །ངང་ཚུལ་བཟང་བས་ཉན་པར་བགྱིད། །
en: With excellent disposition, may we listen To this utterly supreme, sacred Dharma.

source: ཤིན་ཏུ་མི་བཟད་བདུད་ཀྱི་འཁོར། །དེ་རིང་རབ་ཏུ་གཡོས་པར་གྱུར། །
en: “The inexhaustible retinue of Māra Is totally shaken today.

source: དམྱལ་བའི་ཚོང་དུས་ཕྱེ་ནས་ཀྱང་། །དེ་རིང་ཁྱོད་ཀྱི་ཞབས་དྲུང་ལྷགས། །གཞན་ཡང་ལྷ་མང་བྱེ་བའི་ཚོགས། །གླུ་གར་རྣམ་པ་སྣ་ཚོགས་བགྱིད། །
en: Having left behind the trading town of the hell realms, All the myriad sentient beings and gods Perform a variety of songs and dances Here today at your excellent feet.

source: དེ་བཞིན་དུད་འགྲོར་སྐྱེས་པ་ཡི། །སེམས་ཅན་རྣམས་ནི་ཕན་ཚུན་དུ། །མང་དུ་དགྲ་བགྱིད་ཆགས་པའི་ཚུལ། །འཁོར་བའི་ཚུལ་སྤངས་ཆོས་ཀྱང་ཉན། །
en: “All those sentient beings Who are born as animals, Always greedily fighting among one another, Have abandoned worldly conduct to also listen to the Dharma.

source: དམྱལ་བ་ཡི་ནི་སེམས་ཅན་རྣམས། །སྡུག་བསྔལ་མང་པོ་མྱོང་བ་ཡང་། །དེ་རིང་མེ་ཞི་ཤས་ཆེར་བསིལ། །
en: “Today, for sentient beings in the hell realms Who undergo great suffering, The infernal fires are quelled, and they are greatly cooled.

source: ཟས་སྐོམ་དག་གིས་རབ་ཚིམ་ནས། །དེ་རིང་བདེ་བར་གཉིད་ཀྱིས་ལོག །
en: Having been utterly satiated with pure food and drink, They return today to blissful sleep.

source: དེ་རིང་ལྷ་དང་མི་རྣམས་ཀྱིས། །དེ་འདྲའི་ལས་རྣམས་ཐོས་པ་དང་། །སེམས་ཅན་རྣམས་ཀྱིས་དམ་ཆོས་ཚུལ། །སྒྲ་བསྒྲགས་ལ་ནི་མངོན་མཆོད་ཅིང་། །འཇུག་པ་འདི་ནི་ངོ་མཚར་རྨད། །
en: “Today, all gods and humans Hear of actions such as these, And all sentient beings, on account of the proclamation of this sacred Dharma, Make offerings and engage in its practice—a wondrous marvel.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚིག་གཅིག་གསུངས་ན་ནི། །ཇི་ལྟར་བློ་དགའ་བཞིན་དུ་སྣ་ཚོགས་རྟོགས། །
en: “When the Bhagavān speaks a single word, It is understood in various ways, according to however it pleases the mind.

source: ཁྱོད་ནི་སེམས་ཅན་ཀུན་གྱིས་བདེ་མྱོང་བའི། །ཡངས་ཤིང་རྣམ་དག་ཆོས་ནི་སྟོན་པ་མཛད། །
en: You have expounded the vast, pure Dharma That allows all sentient beings to experience bliss.

source: སེམས་ཅན་ཐམས་ཅད་ཡིད་བདེ་རབ་དུལ་ཞིང་། །
en: “With all sentient beings’ minds soothed, they are completely tamed.

source: སེམས་ཀྱང་རབ་དགའ་མཉམ་པར་བྱམས་པར་སེམས། །
en: With minds overjoyed, they generate thoughts of universal loving-kindness.

source: གཅིག་ལ་གཅིག་ནི་ནོངས་པ་བཤགས་ནས་ཀྱང་། །མ་དང་བུ་བཞིན་ཆོས་ནི་ཉན་པར་བགྱིད། །
en: They confess their wrongdoings to each other And listen to the Dharma like a child to its mother.

source: སེམས་ཅན་ཀུན་ཀྱང་བདག་ཉིད་གཙོར་བགྱིས་ནསདེ་རིང་བདག་གི་རང་བཞིན་བསམ་དགོངས་སྙམ། །
en: “Moreover, all sentient beings, who regard their selves as supreme, Have today contemplated, considered, and pondered their own natures.

source: བདག་ལ་ཐུགས་བརྩེས་བདག་གི་སྟན་བཞུགས་ནས། །མི་མཆོག་འདུལ་བའི་ཁ་སྒྱུར་ཆོས་སྟོན་སྙམ། །
en: With compassion toward themselves, they have taken their seats, Pondering the supreme man’s Dharma teachings, which lead to taming.

source: དེ་རིང་ལྷ་ཁྱོད་གདན་གཅིག་སྟེང་བཞུགས་ནས། །དམ་ཆོས་སྤྲིན་གྱི་མདོ་མཆོག་བསྟན་པར་མཛད། །དེ་རིང་ཆོས་ཚོགས་མང་ལ་བྱིན་གྱིས་རློབ། །
en: “Today you, divine one, seated on your throne, Will expound the supreme discourse of the cloud of the sacred Dharma.

source: སྐུ་ཡང་མང་ཞིང་གཟུགས་མང་བའི། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྐུ། །སྟན་རྣམས་ཀུན་ལ་བཞུགས་ནས་ཀྱང་། །
en: The many bodies and forms Of the Tathāgata’s Dharma body Have all taken their various seats;

source: ཁྱོད་ནི་ཆོས་འདི་སྟོན་པར་མཛད། །
en: May you expound this Dharma!

source: ལྷ་ཡི་ལྷ་ལ་བདག་དད་ནས། །བདག་ཅག་དེ་རིང་སྐྱབས་སུ་མཆི། །
en: With faith in you, god of gods, We all take refuge today!

source: ཁང་པར་གནས་པའི་ལྷ་ཀུན་ནི། །ཀྱེ་མ་མི་རྟག་མི་བརྟན་ནོ། །
en: “Alas! All the gods in their palaces Are impermanent and inconstant.

source: སྐྱབས་མ་མཆིས་ཤིང་མགོན་མ་མཆིས། །བསོད་ནམས་ཆུང་ཞིང་སྡིག་པར་བཅས། །
en: Those who do not take refuge and have no protector Have little merit and engage in wrongdoing.

source: ཀླུ་རྣམས་རྒྱ་མཚོར་འདུ་བ་ལྟར། །ལྷ་རྣམས་ཐམས་ཅད་ཁྱོད་ལ་རྟེན། །
en: “Just as the nāgas gather in the ocean, All the gods rely upon you.

source: སྐྱབས་མེད་རྣམས་ཀྱི་སྐྱབས་ལགས་ཏེ། །
en: You are a refuge for all those without refuge.

source: དེ་བས་ཐུབ་ཆེན་རྟག་པ་ལགས། །
en: Thus, you are the permanent, great sage.

source: མགོན་མེད་རྣམས་ཀྱི་མགོན་ཡང་ཁྱོད། །གཉེན་མེད་རྣམས་ལ་རབ་གཉེན་པ། །
en: “You are a protector for all those without protection And a friend to all those without friends.

source: བརྟན་པའི་གནས་ན་བཞུགས་པ་སྟེ། །
en: You dwell in your constant abode.

source: དེ་བས་མི་གཡོ་བརྟན་པ་ལགས། །
en: Thus, you are unwavering and constant.

source: ཀུན་གྱི་རྟེན་ཆེན་གྱུར་པ་སྟེ། །སྨན་པ་ཐེར་ཟུག་བདག་ཉིད་ཆེ། །ནད་ཀྱིས་ཐེབས་པའི་སེམས་ཅན་རྣམས། །ལེགས་སྤྱོད་ཆེ་བའི་བདག་ཉིད་ཅན། །
en: “You are the great support for all, The eternal doctor, the great being, Possessing the most majestic, excellent methods For sentient beings stricken by illness.

source: བཅོམ་ལྡན་ལྷ་ཁྱོད་བསམ་མི་ཁྱབ། །
en: “Bhagavān, divine one, you are inconceivable!

source: དེ་བཞིན་གཤེགས་པ་ཐབས་ཀྱི་སྐུ། །ལྷ་ཡི་ལྷ་སྟེ་ལྷ་ཆེན་པོ། །འཇིག་རྟེན་ཀུན་དང་འཐུན་པར་འཇུག །
en: The Tathāgata’s body of skillful means Is the god of gods, the great god, Arising equally within all worlds.

source: དཔའ་བོ་ཆེན་པོ་གསང་བའི་གསང་། །གསང་བའི་ཆོས་ནི་རབ་སྟོན་བྱ། །
en: “Great hero, you fully expound This secret Dharma, the secret of secrets.

source: ཏིང་འཛིན་གཟུངས་ཀྱི་རྒྱལ་པོ་ཆེ། །དེ་བཞིན་གཤེགས་པ་དེད་དཔོན་ལགས། །
en: You are the king of samādhi and dhāraṇī, The Tathāgata, the great captain!

source: བྱང་ཆུབ་སེམས་དཔའ་གཟི་ཆེན་གྱིས། །མཚུངས་མེད་དཔག་གིས་མི་ལང་བ། །རྟག་པའི་ཟླ་བ་ཡོངས་སུ་བསྐོར། །དཔེ་མེད་བསྐལ་པ་བྱེ་མང་མཛེས། །
en: “Bodhisattva, with your great brilliance— Unparalleled and unfathomable— You make the moon of permanence revolve, Beautifying many millions of unparalleled eons.

source: ཁྱོད་ཀྱི་ཡོན་ཏན་བགྲངས་ལས་འདས། །
en: “Your qualities are beyond enumeration.

source: རིན་ཆེན་འབྱུང་གནས་དེ་བཞིན་གཤེགས། །དཔལ་ཆེན་གཟི་བརྗིད་རྟག་པ་སྟེ། །
en: Jewel-born Tathāgata, Great glorious one, your brilliance is permanent.

source: བསམ་ཡས་སྟོབས་ཀྱི་རྒྱ་མཚོ་ལགས། །
en: You are an ocean of inconceivable strength.

source: སེམས་ཅན་ཀུན་ཕན་བསམ་མི་ཁྱབ། །ཀུན་ལ་བྱམས་ཤིང་ཐུགས་བརྩེ་བ། །
en: “You benefit all sentient beings inconceivably, With loving-kindness and compassion toward all.

source: ཐུབ་སྲས་སྒྲ་གཅན་ཟིན་བཞིན་དུ། །སེམས་ཅན་ཀུན་སྙོམས་བྱམས་པར་དགོངས། །
en: You care for all sentient beings with universal loving-kindness, Just as with your own son Rāhula.

source: དེ་རིང་མཉམ་གྱུར་མཉམ་པར་གཟིགས། །མཐུ་ཆེ་སྟོབས་ཀྱང་ཆེ་བ་ལགས། །
en: “Today, you watch over all equally With great power and even greater strength.

source: མི་ཤེས་སྲིད་པའི་མཚོ་ཆེན་ལས། །དེང་ཁྱོད་བདག་ནི་བསྒྲལ་དུ་གསོལ། །
en: Please liberate us now From this ocean of ignorant existence!

source: བདག་ཅག་ཀུན་གྱིས་བཟོད་པ་གསོལ། །དེ་བཞིན་གཤེགས་པས་བཟོད་པར་མཛོད། །
en: “May we be patient, And may the Tathāgata be patient with us!

source: དམ་ཆོས་འདུ་སྟོན་ཐོས་ནས་ནི། །དེ་བཞིན་གཤེགས་པའི་ཆེ་བ་རྟོགས། །
en: Having listened to these collected teachings of the sacred Dharma, We have understood the Tathāgata’s greatness.

source: མ་འཚལ་བ་ནི་ཀྱེ་རེ་མཚར། །
en: “Oh, how amazing that this is not known!

source: བདག་གིས་ཡུན་རིང་མི་སྙན་བགྱིས། །
en: For a long time, we have engaged in disgraceful deeds.

source: དེ་བཞིན་གཤེགས་རྟག་མ་འཚལ་བའི། །སེམས་ཅན་རྣམས་ནི་ངན་འགྲོར་མཆི། །
en: Not knowing of the Tathāgata’s permanence, Sentient beings move on to unpleasant rebirths.

source: བདག་གིས་ཡུན་རིང་འཁོར་བར་བགྱིས། །ཡོངས་སུ་མྱ་ངན་འདའ་སྙམ་མཛད། །
en: For a long time, we have engaged in cyclic existence, Thinking that you had passed into nirvāṇa.

source: སེམས་ཅན་མར་མེའི་ནང་དག་ཏུ། །ཕྱེ་མ་ལེབ་ནི་མཆོང་བ་བཞིན། །བཅོམ་ལྡན་དམ་ཆོས་དེ་བཞིན་དུ། །ཡོངས་སུ་མྱ་ངན་འདའ་འགྱུར་སྙམ། །
en: Sentient beings are like moths Fluttering within the fire of a lamp, And they think that the sacred Dharma of the Bhagavān Had, similarly, completely passed into nirvāṇa.

source: དེ་ལྟར་སེམས་པར་བགྱིད་པ་ཡི། །ལྷར་བཅས་འཇིག་རྟེན་འཁོར་བར་འགྱུར། །
en: “Thinking in this fashion, We have cycled through the worldly and godly realms.

source: དེང་བདག་ཡང་དག་མཚན་མཐོང་བ། །
en: Now we have seen things correctly.

source: ཀྱེ་མ་རྙེད་ཆེན་ལེགས་པར་རྙེད། །
en: Oh! It is a great discovery, an excellent discovery!

source: ཁྱོད་ཀྱི་ཞབས་མཆོག་གཟི་བརྗིད་ཀྱིས། །དམ་ཆོས་ཚིག་སྨོས་རྒྱ་མཚོ་ཐོས། །
en: “At your brilliant, supreme feet, We have heard the oceanic statements of the sacred Dharma.

source: སྨོན་ལམ་བཏབ་ཅིང་བསྒྲུབས་པ་དེས། །དེ་རིང་བདག་གིས་བདུད་རྩི་འཚལ། །
en: Thus, our aspirations have been fulfilled, And today we have tasted this nectar.

source: བགྱི་བ་ཆེན་པོའི་སོ་སོའི་ལས། །དེ་རིང་བདག་གིས་བསྟེན་པར་བགྱིས། །
en: “Today, we have attended on All your various great deeds.

source: བདག་གི་དེ་རིང་ནད་ཞི་ཞིང་། །ནད་མེད་གནོད་པ་མ་མཆིས་ལ། །དེ་རིང་བདག་གིས་གདུང་བ་བསྲབས། །
en: Today, our illness has been quelled, And, not engaging in harmful deeds, We have diminished our suffering.

source: མཆོག་ཏུ་ཡང་ནི་བདེ་བར་འགྱུར། །འཇིག་རྟེན་ཀུན་ལ་ཐུགས་བརྩེ་བ། །བཅོམ་ལྡན་སངས་རྒྱས་བཤད་དུ་གསོལ། །
en: We have attained the most supreme bliss, And feel compassion toward all worlds. “Bhagavān, please teach!

source: སེམས་ཅན་ཀུན་གྱི་བདེ་བ་སྒྲུབ་པ། །
en: Bring bliss to all sentient beings!

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་པ་ཡིས། །ནད་རྣམས་མ་ལུས་མཛད་པར་གསོལ། །
en: Buddha, Bhagavān, Eliminate all illnesses!

source: དམ་ཆོས་བརྟན་པའི་ཚུལ་གྱི་གཏེར། །སེམས་ཅན་དབུལ་པོ་རྣམས་ཀྱི་ནི། །མི་ཟད་པ་ཡི་བདུད་རྩི་གཏེར། །བཅོམ་ལྡན་སངས་རྒྱས་བཤད་དུ་གསོལ། །
en: “Buddha, Bhagavān, please teach The constant, sacred Dharma that is a treasury For all beggarly sentient beings, An inexhaustible treasury of nectar!

source: རྣམ་པར་སྦྱོང་བའི་ཆོ་ག་ཡི། །ལས་ཀྱི་ཚིག་ནི་སྨོས་པ་རྣམས། །བཅོམ་ལྡན་སངས་རྒྱས་རྒྱས་པར་མཛོད། །
en: “Buddha, Bhagavān, please expound The words and statements That perform the activities of complete purification!

source: རྟག་ཅིང་བརྟན་པའི་འདུ་སྟོན་ལ། །སེམས་ཅན་མང་པོ་དགོད་པར་གསོལ། །
en: Please establish all the multitudinous sentient beings Within your permanent, constant assembly!”

source: སྤྲིན་ཆེན་པོའི་མདོ་ལས་ལྷ་ཐམས་ཅད་འདུས་པ་ཞེས་བྱ་བ་སྟེ་ཕུང་པོ་དང་པོའི་ལེའུ་རྫོགས་སོ།། །།
en: This concludes the first chapter of “The Great Cloud,” “The Assembly of All the Gods.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the bodhisattva mahāsattva Great Cloud Essence said to the Bhagavān,

source: དམ་པའི་ཆོས་བརྟན་པ་སྤྲིན་ཆེན་པོའི་མདོའི་ཚིག་སྨོས་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་ནི་ཨ་ལ་ལ་ངོ་མཚར་རྨད་དུ་བྱུང་བ་ལགས་སོ། །
en: “Ah, these statements of the sacred Dharma teaching of The Great Cloud, spoken by the Tathāgata, are truly a wondrous marvel!

source: བཅོམ་ལྡན་འདས་ཨ་ལ་ལ་སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་སྟེཆོ་འཕྲུལ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མངོན་སུམ་དུ་གྱུར་པ་ལགས་སོ། །
en: Ah, Bhagavān! The domain of this Great Cloud discourse is inconceivable, and the magical manifestation of its miraculous power has appeared right in front of all sentient beings.

source: སྤྲིན་ཆེན་པོའི་མདོ་བཤད་པ་ན་སྤྲིན་ཆེན་པོའི་ཚོགས་ཀྱིས་རིན་པོ་ཆེ་ཐམས་ཅད་དང་། བཅུད་ཐམས་ཅད་ཀྱིས་རྒྱས་བའི་ཆར་གྱི་རྒྱུན་གྱི་ཚོགས་བདུད་རྩིའི་སྒྲ་ལས་བྱུང་བ་རྣམས་ཀྱིས་བདུད་རྩིའི་ཆར་ཆེན་པོ་རབ་ཏུ་ཕབ་བོ། །
en: When this Great Cloud discourse was expounded, a mass of great clouds arose from its nectar-like reverberations, showering down a great, vast rainfall of nectar filled with all sorts of precious substances and elixirs.

source: ཨ་ལ་ལ་དེ་བཞིན་གཤེགས་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེཡུལ་བསམ་གྱིས་མི་ཁྱབ་པའི་མདོ་ཤིན་ཏུ་ལེགས་པར་གསུངས་སོ། །
en: Ah! The Tathāgata, who is inconceivable, has excellently uttered this discourse of the inconceivable domain.

source: ཨ་ལ་ལ་སེམས་ཅན་ཐམས་ཅད་ནི་བསོད་ནམས་བགྱིས་པ་ལགས་སོ། །
en: Ah! All sentient beings have certainly cultivated merit.

source: ཨ་ལ་ལ་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: Ah! The fruition of this merit is inconceivable!

source: སེམས་ཅན་རྣམས་ལྷའི་བདེ་བའི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱད་པ་ལ་ཡོངས་སུ་སྤྱོད་དོ། །
en: Sentient beings are relishing the enjoyment and delights of divine bliss.

source: དེ་རིང་སེམས་ཅན་ཐམས་ཅད་ལྷ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རྩེ་བར་གྱུར་ཏོ། །
en: Today, all sentient beings frolic together with the gods.

source: སྤྲིན་ཆེན་པོའི་མདོའི་གཏེར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལོངས་སྤྱོད་མི་ཟད་པའི་གཏེར་དུ་གྱུར་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “May the Bhagavān expound the treasure-like Great Cloud discourse, which is an inexhaustible treasury of enjoyments for all sentient beings!

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བ་དང་། མཚན་ཉིད་མ་མཆིས་པའི་ཆར་
en: Today, may the Bhagavān shower down the rainfall of the Tathāgata’s qualities of permanence, eternality, constancy, tranquility, and signlessness!

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རིང་དབབ་ཏུ་གསོལ་སྤྲིན་ཆེན་པོའི་མདོ་ལས་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་ཆུས་རྒྱས་པའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཚོགས་ཀྱི་འབྲུག་སྒྲ་འཁོར་བའི་ཉོན་མོངས་པའི་ཚོགས་ཀྱི་ནམ་མཁའི་དཀྱིལ་དུ་སྒྲོགས་ཤིང་དེ་བཞིན་གཤེགས་པ་རྟག་པའི་སྒྲའི་ཚིག་རྣམས་འབེབས་ཏེ
en: With the thundering roar of the mass of Dharma-clouds that disperse the rainfall of the samādhis and dhāraṇīs of this Great Cloud discourse resounding in the center of the sky of worldly afflictions, may you shower down the message of the Tathāgata’s permanence.

source: འུར་འུར། ཆེམ་ཆེམ་ཞིང་མཆིས་ལ། དམ་པའི་ཆོས་ནུབ་པར་མི་འགྱུར་ཞིང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་བ་དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་གི་གློག་སྟོན་ཏེ། རྟག་པའི་སྒྲའི་བཅུད་བསིལ་བའི་དེ་ཁོ་ན་དྲག་ཅིང་མི་ཟད་པའི་རྒྱུན་གྱི་ཆར་གྱི་ཚོགས་ཀྱིས་ཉོན་མོངས་པའི་སྦུབས་ཀྱི་ལམ་རབ་ཏུ་སེལ་བའི་དམ་པའི་ཆོས་ཀྱི་ཆར་ཆེན་པོ་རབ་ཏུ་དབབ་ཏུ་གསོལ།
en: Upon the blazing fields ignited by the lightning bolt of the concealed teaching that the sacred Dharma will not disappear and the Tathāgata does not pass into complete nirvāṇa, may you shower down the powerful, inexhaustible rainfall of the sacred Dharma, the cooling elixir of the message of permanence, the path that utterly clears away the cocoon of the afflictions!

source: སེམས་ཅན་ཐམས་ཅད་མངོན་སུམ་དུ་དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའི་སྒྲའི་ཚིག་གི་བཅུད་ཀྱི་རོ་མངར་བ་བཞི་རོ་ཤིན་ཏུ་བདའ་བ་ཐམས་ཅད་དང་ལྡན་པའི་ཆོས་ལ་སྤྱོད་པར་མཛད་དུ་གསོལ།
en: May all sentient beings directly practice this Dharma that is endowed with the four extremely sweet tastes of the elixir-like message of the Tathāgata’s permanence, eternality, constancy, and tranquility!

source: སྔར་གསུངས་པའི་ཚིག་སྨོས་པ་རྣམ་པར་སྦྱོང་བར་བགྱིད་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ། །
en: May the Bhagavān give an explanation that is distinct from previously spoken utterances!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་ལེགས་སོ་ལེགས་སོ། །
en: The Bhagavān replied, “Excellent, Great Cloud Essence, excellent!

source: འདི་ལྟ་བུའི་སྤྲིན་ཆེན་པོ་མངར་བ་བཞི་རོ་ཐམས་ཅད་དང་འདྲེས་པའི་ཆར་རྟག་ཏུ་འབེབས་པར་འདོད་པས་ནི་སྤྲིན་ཆེན་པོ་རྡོ་རྗེའི་མདོ་གཟུང་བར་བྱའོ། །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་བཤད་པར་བྱའོ། །ཤིན་ཏུ་དགའ་བ་ཡང་བསྐྱེད་པར་བྱའོ། །དེ་ལ་མངོན་པར་བརྩོན་པར་ཡང་བྱའོ། །
en: Since you long in this way for the great cloud to constantly shower down the rainfall in which all these four sweet tastes are mixed together, you should uphold this vajra-like Great Cloud discourse, you should expound it to others extensively, you should be extremely delighted in it, and you should strive diligently toward it!

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལས་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པ་རིན་པོ་ཆེའི་མཛོད་ཀྱི་འབྱུང་གནས། ཆོས་ཀྱི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བཞི་བརྒྱ་རྒྱས་པར་ཉོན་ཅིག །
en: Great Cloud Essence, listen carefully to this elaboration of the four hundred samādhi gateways of this Great Cloud discourse called the king of the magical manifestation of Dharma, the source of the precious storehouse of abiding within inconceivable liberation.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་ཟབ་མོ་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Great Cloud Essence, within this Great Cloud discourse there is the samādhi called the tide of the deep, constant ocean.

source: ཏིང་ངེ་འཛིན་དེ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཏིང་ངེ་འཛིན་གྱི་རྒྱ་མཚོར་ཡང་འགྱུར་རོ། །
en: Bodhisattva mahāsattvas who possess this samādhi will become oceans of samādhi.

source: ཏིང་ངེ་འཛིན་ཡང་དག་པར་སོགས་པར་ཡང་འགྱུར་རོ། །
en: They will correctly accumulate the samādhis.

source: ཐོས་པའི་རྒྱ་མཚོར་ཡང་འགྱུར་རོ། །
en: They will become oceans of learning.

source: ཐོས་པ་ཡང་དག་པར་སོགས་པར་ཡང་འགྱུར་རོ། །
en: They will correctly accumulate learning.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་སོམ་ཉི་མི་ཟ་ཞིང་ཡིད་གཉིས་མེད་པ་ཐེ་ཙོམ་ཟ་བར་ཡང་མི་འགྱུར་རོ། །
en: They will not be skeptical or ambivalent or entertain doubts about the attainment of unsurpassed, complete, and perfect awakening.

source: མི་ཁོམ་པ་རྣམས་སུ་སྐྱེ་བར་ཡང་མི་འགྱུར་རོ། །
en: They will not be born in unfree states of existence.

source: ཚེ་རབས་དྲན་པར་ཡང་འགྱུར་རོ། །
en: They will attain the recollection of past lives.

source: འཁོར་བའི་ལས་ཀྱི་ཞིང་གི་རྒྱ་མཚོ་ལ་སྲེད་པར་ཡང་འགྱུར་རོ། །
en: They will thirst for the expansive ocean of saṃsāric activity.

source: ཚེ་རབས་ཐམས་ཅད་དུ་ཐ་ན་རྨི་ལམ་ན་ཡང་སངས་རྒྱས་མཐོང་བ་དང་འབྲལ་བར་ཡང་མི་འགྱུར་རོ། །
en: They will see the buddhas and never be separated from this sight during all their lifetimes, even in dreams.

source: དེ་དག་གི་དགེ་བའི་ཆོས་རྣམས་ལ་བར་ཆད་བྱ་བའི་ཕྱིར་བདུད་སྡིག་ཅན་གླགས་ལྟ་བ་དང་སྐབས་ཚོལ་བས་གླགས་རྙེད་པར་ཡང་མི་འགྱུར་རོ། །
en: They will not allow evil Māra to find and take advantage of opportunities to hinder the virtuous Dharmas of the buddhas.

source: ང་རྒྱལ་ཆོམས་པར་ཡང་འགྱུར་རོ། །
en: They will subdue pride.

source: གཟུངས་ཐོབ་པར་ཡང་འགྱུར་རོ། །
en: They will obtain dhāraṇīs.

source: དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་དཔྱོད་པ་ལ་མཁས་པར་ཡང་འགྱུར་རོ། །
en: They will become skilled at analyzing the concealed intent of the Tathāgata’s speech.

source: ཆོས་ཐམས་ཅད་ཀྱི་གསང་བའི་སྒོར་འཇུག་པར་ཡང་འགྱུར་རོ། །
en: They will enter the secret gateways of all phenomena.

source: དེ་བཞིན་གཤེགས་པའི་གཏེར་ཡང་དག་པར་སྟོན་པར་ཡང་འགྱུར་རོ། །
en: They will correctly expound the Tathāgata’s treasury.

source: དེ་བཞིན་གཤེགས་པའི་ཚུལ་ལ་འཇུག་པར་ཡང་འགྱུར་རོ། །
en: They will practice the way of the Tathāgata.

source: དེ་བཞིན་གཤེགས་པའི་རྒྱ་མཚོའི་ཆུ་སྲིན་དུ་ཡང་འགྱུར་རོ། །
en: They will become a makara in the Tathāgata’s ocean.

source: དེ་བཞིན་གཤེགས་པའི་གཞུང་ལུགས་ཀྱི་ནང་དུ་ཆུད་པར་ཡང་འགྱུར་རོ། །
en: They will enter the Tathāgata’s scriptural tradition.

source: དེ་བཞིན་གཤེགས་པའི་སྒྱུ་འཕྲུལ་གསང་བའི་སྲུངས་མར་ཡང་འགྱུར་རོ། །
en: “They will become guards of the secret of the Tathāgata’s illusory emanation.

source: དེ་བཞིན་གཤེགས་པའི་གསུང་བརྗོད་པར་ཡང་འགྱུར་རོ། །
en: They will proclaim the Tathāgata’s speech.

source: དེ་བཞིན་གཤེགས་པའི་དམིགས་པ་ལ་རྣལ་འབྱོར་པར་ཡང་འགྱུར་རོ། །
en: They will join with the Tathāgata’s perception.

source: དེ་བཞིན་གཤེགས་པའི་ཉི་མའི་འོད་ཟེར་དུ་ཡང་འགྱུར་རོ། །
en: They will become the light rays of the Tathāgata’s sun.

source: དེ་བཞིན་གཤེགས་པའི་ཟླ་བའི་དཀྱིལ་འཁོར་གྱི་གཟིར་ཡང་འགྱུར་རོ། །
en: They will become the brilliance of the Tathāgata’s moon.

source: དེ་བཞིན་གཤེགས་པའི་ཏོག་གི་རྩེ་མོའི་མཆོག་ཏུ་ཡང་འགྱུར་རོ། །
en: They will become the highest tip of the Tathāgata’s emblem.

source: དེ་བཞིན་གཤེགས་པའི་མཚམས་འཛིན་པར་ཡང་འགྱུར་རོ། །
en: They will hold the Tathāgata’s borders.

source: དེ་བཞིན་གཤེགས་པའི་ཕྲིན་ལས་ལ་རྩོམ་པར་ཡང་འགྱུར་རོ། །
en: They will undertake the Tathāgata’s activities.

source: དེ་བཞིན་གཤེགས་པའི་རྩལ་གྱི་ཤུགས་སུ་ཡང་འགྱུར་རོ། །
en: They will become as potent as the Tathāgata.

source: དེ་བཞིན་གཤེགས་པའི་མུ་སྟེགས་ལ་ངེས་པའི་པད་མ་དཀར་པོར་ཡང་འགྱུར་རོ། །
en: They will become the white lotus of the Tathāgata, which brings certainty to non-Buddhists.

source: དེ་བཞིན་གཤེགས་པའི་དགྱེས་པ་ལ་དགའ་བར་ཡང་འགྱུར་རོ། །
en: They will delight in the Tathāgata’s joy.

source: དེ་བཞིན་གཤེགས་པའི་མཛོད་ཀྱི་དཀོར་བར་ཡང་འགྱུར་རོ། །
en: They will become treasurers of the Tathāgata’s storehouse.

source: དེ་བཞིན་གཤེགས་པ་ལ་རྟག་པ་ཉིད་དུ་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: They will behold the Tathāgata’s permanence.

source: དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། ཐེར་ཟུག་པ་ཉིད་ཤིན་ཏུ་གསལ་བར་མཐོང་ནས་བདག་ཉིད་བསྔགས་པ་བརྗོད་པའི་རྒྱལ་པོར་ཡང་འགྱུར་རོ། །
en: They will see the permanence and eternality of the Tathāgata with exceptional clarity and become kings of praising his exalted character.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཐེར་ཟུག་པའི་སྐུ་ཡིན་ནོ་ཞེས་ཐེར་ཟུག་ཏུ་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: “They will profess eternality, saying that the Tathāgata’s body is eternal.
